Edmond-Sung-Tymphany/Hendrix_M_Lite_GD/sw/project_files/BnO_fs1_mk2/stm32/attachedDevices.c
static const tGPIODevice gpioIoexpanderConfig =
{
  .deviceInfo.deviceID = IO_EXPANDER_DEV_ID,
  .deviceInfo.deviceType = GPIO_DEV_TYPE,
  .usedGPIOPinNum =  ArraySize(gpioIoexpanderPin),
  .pGPIOPinSet = gpioIoexpanderPin
};

/****************************************
 * Device: DSP                          *
 ****************************************/
static const tGPIOPin gpioDspPins[] =
{
    {GPIO_OUT_DSP_RST_N,   IO_PORT_B,  IO_BIT_2,   GPIO_DIGITAL_OUTPUT,  GPIO_DEFAULT_OUT_LOW,   ODC_DISABLE}, //PB2 
    {GPIO_OUT_BOOST_CAP1,  IO_PORT_B,  IO_BIT_1,   GPIO_DIGITAL_OUTPUT,  GPIO_DEFAULT_OUT_LOW,   ODC_DISABLE}, //PB1
    {GPIO_OUT_BOOST_CAP2,  IO_PORT_C,  IO_BIT_7,   GPIO_DIGITAL_OUTPUT,  GPIO_DEFAULT_OUT_LOW,   ODC_DISABLE}, //PC7
    {GPIO_OUT_BOOST_EN,    IO_PORT_B,  IO_BIT_4,   GPIO_DIGITAL_OUTPUT,  GPIO_DEFAULT_OUT_LOW,   ODC_DISABLE}, //PB4 
};
static const tGPIODevice gpioDspConfig =
{
  .deviceInfo.deviceID = DSP_DEV_ID,
  .deviceInfo.deviceType = GPIO_DEV_TYPE,
  .usedGPIOPinNum =  ArraySize(gpioDspPins),
  .pGPIOPinSet = gpioDspPins
};


static const tI2CDevice i2cDspConfig =
{
    .deviceInfo.deviceID = DSP_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_TWO, //I2C2
    .pvSlaveCallback = NULL,  //not-used parameter
    .regAddrLen = REG_LEN_16BITS,
    .baudRate = I2C2_CLK_KHZ,
    .devAddress = 0x70,
};



/****************************************
 * Device: AMP TAS5760                  *
 ****************************************/
static const tI2CDevice i2cAmpWooferConfig = //Woofer Amplifier
{
    .deviceInfo.deviceID = AMP_WOOFER_1_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_TWO, //I2C2
    .pvSlaveCallback = NULL,
    .regAddrLen = REG_LEN_8BITS,
    .baudRate = I2C2_CLK_KHZ,
    .devAddress = 0xDA,
};

static const tI2CDevice i2cAmpTweeterConfig = //Tweeter Amplifier
{
    .deviceInfo.deviceID = AMP_TWEETER_1_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_TWO, //I2C2
    .pvSlaveCallback = NULL,
    .regAddrLen = REG_LEN_8BITS,
    .baudRate = I2C2_CLK_KHZ,
    .devAddress = 0xD8,
};




/****************************************
 * Device: Audio                        *
 ****************************************/
static const tGPIOPin gpioAudioPins[] =
{
    {GPIO_IN_DSP_TUNE,     IO_PORT_A,  IO_BIT_15, GPIO_DIGITAL_INPUT,   GPIO_ACTIVE_HIGH,       ODC_NOT_APPLICABLE}, //PA15
    {GPIO_OUT_SYSPWR_ON,   IO_PORT_B,  IO_BIT_0,  GPIO_DIGITAL_OUTPUT,  GPIO_DEFAULT_OUT_LOW,   ODC_DISABLE}, //PB0
    {GPIO_IN_AMP_FAULTZ,   IO_PORT_B,  IO_BIT_14, GPIO_DIGITAL_INPUT,   GPIO_ACTIVE_LOW,        ODC_NOT_APPLICABLE},  //PB14. SPK_FAULT is open drain, MCU need to week pull low
    {GPIO_OUT_AMP_SDZ,     IO_PORT_B,  IO_BIT_13, GPIO_DIGITAL_OUTPUT,  GPIO_DEFAULT_OUT_LOW,   ODC_DISABLE}, //PB13
};
static const tGPIODevice gpioAudioConfig =
{
  .deviceInfo.deviceID    = AUDIO_DEV_ID,
  .deviceInfo.deviceType  = GPIO_DEV_TYPE,
  .usedGPIOPinNum =  ArraySize(gpioAudioPins),
  .pGPIOPinSet = gpioAudioPins
};



/****************************************
 * Device: ASE-TK                       *
 ****************************************/
static const tGPIOPin gpioAsetkPins[] =
{
    /* GPIO_OUT_BOOT_STATUS_SW should defaultly pull low, because
     *   Normal condition: pull low
     *   Before jump to ST-BL: pull high
     */
    {GPIO_OUT_BOOT_STATUS_SW,   IO_PORT_B,  IO_BIT_8,  GPIO_DIGITAL_OUTPUT, GPIO_DEFAULT_OUT_LOW,  ODC_DISABLE}, //PB8
    {GPIO_OUT_ASE_RST_N,        IO_PORT_A,  IO_BIT_11, GPIO_DIGITAL_OUTPUT, GPIO_DEFAULT_OUT_HIGH, ODC_DISABLE}, //PA11
    {GPIO_OUT_ASE_SYS_EN,       IO_PORT_A,  IO_BIT_12, GPIO_DIGITAL_OUTPUT, GPIO_DEFAULT_OUT_HIGH, ODC_DISABLE}, //PA12
    {GPIO_IN_ASE_REQ_PDN,       IO_PORT_A,  IO_BIT_8,  GPIO_DIGITAL_INPUT,  GPIO_ACTIVE_HIGH,      ODC_NOT_APPLICABLE},  //PA8 
    
    //TODO: A9-MK3 can control ASE 5V, FSx-MK2 may support it on 
//    {GPIO_OUT_ASE_5V_EN,        IO_PORT_C,  IO_BIT_7,  GPIO_DIGITAL_OUTPUT, GPIO_DEFAULT_OUT_HIGH,  ODC_DISABLE},//PC7
};
static const tGPIODevice gpioAsetkConfig =
{
  .deviceInfo.deviceID    = ASETK_DEV_ID,
  .deviceInfo.deviceType  = GPIO_DEV_TYPE,
  .usedGPIOPinNum =  ArraySize(gpioAsetkPins),
  .pGPIOPinSet = gpioAsetkPins
};


static const tUARTDevice uartAsetkConfig = {
    .deviceInfo.deviceID    = ASETK_DEV_ID,
    .deviceInfo.deviceType  = UART_DEV_TYPE,
    .baudrate   = 115200,
    .uartId     = TP_UART_DEV_1, //PA9, PA10
    .byteSize   = TP_UART_BYTE_SIZE_9_BITS,
    .parity     = TP_UART_PARITY_EVEN,
    .stopBits   = TP_UART_STOP_BIT_1,
    .dmaEnable  = FALSE,
    .interrupt.priority    = 0,
    .interrupt.subPriority = 0,     // not-used, for compatibility with PIC32
};



/****************************************
 * Device: LED                         *
 ****************************************/
static /*const */tIoExpanderLedMap ioeLedMap[] =
{ // ledID        pure_color    port   pin
    {LED1_CONN_RED,      RED,         0,    0}, // IO-Expander OUT1
    {LED2_CONN_ORG,      ORANGE,      0,    1}, // IO-Expander OUT2
    {LED3_CONN_BLUE,     BLUE,        0,    2}, // IO-Expander OUT3
    {LED4_CONN_WHT,      WHITE,       0,    3}, // IO-Expander OUT4
    {LED5_PROD_WHT,      WHITE,       0,    4}, // IO-Expander OUT5
    {LED6_PROD_WHT,      WHITE,       0,    5}, // IO-Expander OUT6
    {LED7_PROD_ORG,      ORANGE,      0,    6}, // IO-Expander OUT7
    {LED8_PROD_WHT,      WHITE,       0,    7}, // IO-Expander OUT8
    {LED9_PROD_ORG,      ORANGE,      0,    8}, // IO-Expander OUT9
    {LED10_GOOGLE_YEL,   YELLOW,      0,    9}, // IO-Expander OUT10
    {LED11_PROD_ORG,     ORANGE,      0,   10}, // IO-Expander OUT11
    {LED12_PROD_WHT,     WHITE,       0,   11}, // IO-Expander OUT12
    {LED13_PROD_ORG,     ORANGE,      0,   12}, // IO-Expander OUT13
    {LED14_PROD_WHT,     WHITE,       0,   13}, // IO-Expander OUT14
    {LED15_ALWAYS_ON_WHT,WHITE,       0,   14}, //rotate key enable
    {LED16_GOOGLE_GRE,   GREEN,       0,   15}, // IO-Expander OUT16
    {LED17_GOOGLE_BLUE,  BLUE,        0,   16}, // IO-Expander OUT17
    {LED18_GOOGLE_RED,   RED,         0,   17}, // IO-Expander OUT18
    {LED19_PROD_ORG,     ORANGE,      0,   18}, // IO-Expander OUT19
    {LED20_PROD_WHT,     WHITE,       0,   19}, // IO-Expander OUT20
};

static /*const */tI2CDevice  ioeI2cDeviceConf =
{
    .deviceInfo.deviceID= IO_EXPANDER_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode            = I2C_MASTER_MODE,
    .channel            = I2C_CHANNEL_ONE,  // I2C1
    .pvSlaveCallback    = NULL,
    .regAddrLen         = REG_LEN_8BITS,
    .baudRate           = I2C1_CLK_KHZ,
    .devAddress         = 0x2C<<1,
};

static tIoExpanderConfig ioeLedConfig =
{
    .swResetValue = 0x00,
    .ledModePortA = 0x00,
    .ledModePortB = 0x00,
    .outPutPortA  = 0xff,
    .outPutPortB  = 0xff,
    .controlValue = (0x10 | 0x03),
};

